Revit 2027 API
CurveElement.GetLineStyleIds Method
 Ids of all line style Elements that are applicable to this curve element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetLineStyleIds()
Public Function GetLineStyleIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetLineStyleIds()
member GetLineStyleIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 A collection of Ids of line style elements.
Remarks
 The elements are of the [!:Autodesk::Revit::DB::GraphicsStyle] class.
See Also
Reference
CurveElement Class
Autodesk.Revit.DB Namespace